#include <iostream>
#include <Windows.h>
using namespace std;

// Задача 1.2 Обчислення за відомими формулами

int main() {
	// Встановлення кодуванню виводу в консоль (для коректного відображення літери і)
	SetConsoleOutputCP(1251);

	// Створення змінної, що зберігає прискорення вільного падіння
	double g = 9.8;

	for (int t = 1; t < 3; t++) {
		// Вивід у консоль значення пройденого шляху після t-ої секунди
		cout << "Пройдений шлях після " << t << "-ої секунди: ";
		cout << g * t * t / 2 << endl;
	}
}